# Terraform plan for staging
  
  ```
  Plan: 1 to add, 0 to change, 0 to destroy
  ```

  <details>
  <summary>Terraform Plan Details</summary>

  ```
  module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=stg-piny940/iamcredentials.googleapis.com]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=stg-clubroom.piny940.com]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=stg-terraform-remote-backend.piny940.com]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=stg-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=stg-piny940/roles/owner/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_service_account_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:staging]
module.terraform.google_iam_workload_identity_pool_provider.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool/providers/terraform-github-actions]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube_workload_identity.google_secret_manager_secret.home_kubernetes_cluster_jwks will be created
  + resource "google_secret_manager_secret" "home_kubernetes_cluster_jwks" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "stg-piny940"
      + secret_id             = "home-kubernetes-cluster-jwks"
      + terraform_labels      = {
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "home-cluster"
        }

      + replication {
          + auto {
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
  ```

  </details>
Please apply the changes to the staging environment using the [Terraform apply workflow](https://github.com/piny940/infra/actions/workflows/tf-apply.yaml)
